[
    {
        "type": "message",
        "user": "U8SK3QRPG",
        "text": "Okay",
        "ts": "1519579349.000110"
    },
    {
        "type": "message",
        "user": "U8RFVCE7P",
        "text": "The grades for assignment 1 are being posted. It has surprised me that so few of you recognized that the relationship between d, l and n should be d ~ l n^0.5  This is actually a well-known result (see Wikipedia article on the Random Walk): <https:\/\/en.wikipedia.org\/wiki\/Random_walk>",
        "attachments": [
            {
                "image_url": "https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/9b\/Random_Walk_Simulator.gif",
                "image_width": 600,
                "image_height": 600,
                "image_bytes": 293755,
                "title": "Random walk",
                "title_link": "https:\/\/en.wikipedia.org\/wiki\/Random_walk",
                "author_name": "Wikipedia",
                "author_link": "http:\/\/en.wikipedia.org\/",
                "text": "A random walk is a mathematical object, known as a stochastic or random process, that describes a path that consists of a succession of random steps on some mathematical space such as the integers. An elementary example of a random walk is the random walk on the integer number line, \n  \n    \n      \n        \n          Z\n        \n      \n    \n    {\\displaystyle \\mathbb {Z} }\n  , which starts at 0 and at each step moves +1 or −1 with equal probability. Other examples include the path traced by a molecule as it travels in a liquid or a gas, the search path of a foraging animal, the price of a fluctuating stock and the financial status of a gambler can all be approximated by random walk models, even though they may not be truly random in reality. As illustrated by those examples, random walks have applications to many scientific fields including ecology, psychology, computer science, physics, chemistry, biology as well as economics. Random walks explain the observed behaviors of many processes in these fields, and thus serve as a fundamental model for the recorded stochastic activity. As a more mathematical application, the value of pi can be approximated by the usage of random walk in agent-based modelling environment. The term random walk was first introduced by Karl Pearson in 1905.\nVarious types of random walks are of interest, which can differ in several ways. The term itself most often refers to a special category of Markov chains or Markov processes, but many time-dependent processes are referred to as random walks, with a modifier indicating their specific properties. Random walks (Markov or not) can also take place on a variety of spaces: commonly studied ones include graphs, others on the integers or the real line, in the plane or in higher-dimensional vector spaces, on curved surfaces or higher-dimensional Riemannian manifolds, and also on groups finite, finitely generated or Lie. The time parameter can also be manipulated. In the simplest context the walk is in discrete time, that is a sequence of random variables (Xt) = (X1, X2,...) indexed by the natural numbers. However, it is also possible to define random walks which take their steps at random times, and in that case the position Xt has to be defined for all times t ∈ [0,+∞). Specific cases or limits of random walks include the Lévy flight and diffusion models such as Brownian motion.\nRandom walks are a fundamental topic in discussions of Markov processes. Their mathematical study has been extensive. Several properties, including dispersal distributions, first-passage or hitting times, encounter rates, recurrence or transience, have been introduced to quantify their behaviour.",
                "fallback": "wikipedia: Random walk",
                "service_icon": "https:\/\/a.slack-edge.com\/bfaba\/img\/unfurl_icons\/wikipedia.png",
                "id": 1
            }
        ],
        "ts": "1519614154.000136"
    }
]